local Add, Craft = Ambi.SimpleInventory.AddClass, Ambi.SimpleInventory.AddCraft

-- ======================================================================================================================== --
for i = 1, 5 do
   Craft( 'plastic chemical t'..i, 'Пластик', CATEGORY, '', 0.6 - ( i * 0.1 ), {
        [ 'coal' ] = 8 - i,
   }, {
        [ 'plastic' ] = 1,
   } )
end

-- ======================================================================================================================== --
for i = 1, 5 do
   Craft( 'glass chemical t'..i, 'Стекло', CATEGORY, '', 2 - ( i * 0.1 ), {
        [ 'sand' ] = 25 - i,
   }, {
        [ 'glass' ] = 1,
   } )
end

-- ======================================================================================================================== --
for i = 1, 5 do
   Craft( 'polyethylene t'..i, 'Полиэтилен', CATEGORY, '', 1.95 - ( i * 0.75 ), {
        [ 'plastic' ] = 7 - i,
   }, {
        [ 'polyethylene' ] = 1,
   } )
end

-- ======================================================================================================================== --
for i = 2, 5 do
   Craft( 'phosphorus t'..i, 'Фосфор', CATEGORY, '', 0.15, {
        [ 'urine' ] = 2,
        [ 'sand' ] = 12 - i,
   }, {
        [ 'phosphorus' ] = 1,
   } )
end

for i = 2, 5 do
   Craft( 'phosphorus red t'..i, 'Фосфор: Красный', CATEGORY, '', 0.25, {
        [ 'gunpowder' ] = 1,
        [ 'phosphorus' ] = 4,
   }, {
        [ 'phosphorus red' ] = 1,
   } )
end

-- ======================================================================================================================== --
for i = 3, 5 do
   Craft( 'explosive t'..i, 'Взрывчатое Вещество', CATEGORY, '', 1, {
        [ 'cloth' ] = 4,
        [ 'phosphorus red' ] = 5,
        [ 'gunpowder' ] = 25 - i,
   }, {
        [ 'explosive' ] = 1,
   } )
end

-- ======================================================================================================================== --
for i = 2, 5 do
   Craft( 'gunpowder t'..i, 'Порох', CATEGORY, '', 5 - ( 0.35 * i ), {
        [ 'sulfur' ] = 10 - i,
        [ 'coal' ] = 12 - i,
   }, {
        [ 'gunpowder' ] = 1,
   } )
end